{"class_name": "Functional", "config": {"name": "functional_53", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 350, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_51"}, "name": "input_51", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "lstm_68", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 100, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.2, "implementation": 1}, "name": "lstm_68", "inbound_nodes": [[["input_51", 0, 0, {}]]]}, {"class_name": "RepeatVector", "config": {"name": "repeat_vector_24", "trainable": true, "dtype": "float32", "n": 30}, "name": "repeat_vector_24", "inbound_nodes": [[["lstm_68", 0, 1, {}]]]}, {"class_name": "LSTM", "config": {"name": "lstm_69", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 100, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.2, "implementation": 1}, "name": "lstm_69", "inbound_nodes": [[["repeat_vector_24", 0, 0, {}], ["lstm_68", 0, 1, {}], ["lstm_68", 0, 2, {}]]]}, {"class_name": "Dot", "config": {"name": "dot_16", "trainable": true, "dtype": "float32", "axes": [2, 2], "normalize": false}, "name": "dot_16", "inbound_nodes": [[["lstm_69", 0, 0, {}], ["lstm_68", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "dtype": "float32", "activation": "softmax"}, "name": "activation_8", "inbound_nodes": [[["dot_16", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "dot_17", "trainable": true, "dtype": "float32", "axes": [2, 1], "normalize": false}, "name": "dot_17", "inbound_nodes": [[["activation_8", 0, 0, {}], ["lstm_68", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_8", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_8", "inbound_nodes": [[["dot_17", 0, 0, {}], ["lstm_69", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_24", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_39", "trainable": true, "dtype": "float32", "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "time_distributed_24", "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}], "input_layers": [["input_51", 0, 0]], "output_layers": [["time_distributed_24", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}