{"class_name": "Functional", "config": {"name": "functional_17", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 200, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_53"}, "name": "input_53", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "lstm_57", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm_57", "inbound_nodes": [[["input_53", 0, 0, {}]]]}, {"class_name": "RepeatVector", "config": {"name": "repeat_vector_17", "trainable": true, "dtype": "float32", "n": 24}, "name": "repeat_vector_17", "inbound_nodes": [[["lstm_57", 0, 1, {}]]]}, {"class_name": "LSTM", "config": {"name": "lstm_58", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.2, "implementation": 1}, "name": "lstm_58", "inbound_nodes": [[["repeat_vector_17", 0, 0, {}], ["lstm_57", 0, 1, {}], ["lstm_57", 0, 2, {}]]]}, {"class_name": "Dot", "config": {"name": "dot_20", "trainable": true, "dtype": "float32", "axes": [2, 2], "normalize": false}, "name": "dot_20", "inbound_nodes": [[["lstm_58", 0, 0, {}], ["lstm_57", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "dtype": "float32", "activation": "softmax"}, "name": "activation_10", "inbound_nodes": [[["dot_20", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "dot_21", "trainable": true, "dtype": "float32", "axes": [2, 1], "normalize": false}, "name": "dot_21", "inbound_nodes": [[["activation_10", 0, 0, {}], ["lstm_57", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_10", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_10", "inbound_nodes": [[["dot_21", 0, 0, {}], ["lstm_58", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_9", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "time_distributed_9", "inbound_nodes": [[["concatenate_10", 0, 0, {}]]]}], "input_layers": [["input_53", 0, 0]], "output_layers": [["time_distributed_9", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}